#!/bin/zsh

File="app.out"

if [ -e $File ]; then
  echo "==================================================="
  echo "기존 make 내역이 존재합니다. => clean 후 make"

  echo "<========================"
  echo "make clean 명령어 로그 내역"
  make clean
  echo "========================>"


  echo "<========================"
  echo "make 명령어 로그 내역"
  make
  echo "========================>"


  echo "<========================"
  echo "실행파일 로그 내역"
  ./$File
  echo "========================>"

else
  echo "==================================================="
  echo "기존 make 내역 존재하지 않습니다. => 바로 make"

  echo "<========================"
  echo "make 명령어 로그 내역"
  make
  echo "========================>"


  echo "<========================"
  echo "실행파일 로그 내역"
  ./$File
  echo "========================>"
fi
